Revit 2027 API
Form.IsVertexReference Method
Tell if the pick is the reference to a vertex of the form.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsVertexReference(
	Reference vertexReference
)
Public Function IsVertexReference (
	vertexReference As Reference
) As Boolean
public:
bool IsVertexReference(
	Reference^ vertexReference
)
member IsVertexReference :
        vertexReference : Reference -> bool
Parameters
vertexReference Reference
Reference to be checked.
Return Value
Boolean
See Also
Reference
Form Class
Autodesk.Revit.DB Namespace